artillery/browse_product.yml
config:
    target: "https://e-commerce-app-vtwx.onrender.com"
    phases:
        - duration: 120
          arrivalRate: 10
          rampTo: 50
          name: Warm up phase

        - duration: 240
          arrivalRate: 50
          rampTo: 300
          name: Ramp up load

        - duration: 60
          arrivalRate: 1000
          name: Spike up load

        - duration: 120
          arrivalRate: 300
          rampTo: 10
          name: Cool down phase
    variables:
        category:
            - eletronics
            - fashion
            - home
            - books
            - toys
scenarios:
    - name: Browse all products
      flow:
          - get:
                url: "/products?page={{ $randomNumber(1,10) }}&limit=20"

    - name: Search by category
      flow:
          - get:
                url: "/products?category={{ category }}&page=1&limit=10"

    - name: Browse paginated results
      flow:
          - get:
                url: "/products?page={{ $randomNumber(1,100) }}&limit=10"